local S = {}

--==========================
-- GLOBAL SHARED STATE
--==========================

S.entries = {}



-------------------------------------------------------------------------------
-- Alphabets
-------------------------------------------------------------------------------
S.vowels = {"A", "a", "Á", "á", "À", "à", "Ä", "ä", "Ā", "ā", "E", "e",
    "É", "é", "È", "è", "Ë", "ë", "Ē", "ē", "I", "i", "Í", "í", "Ì", "ì", "Ī",
    "ī", "O", "o", "Ó", "ó", "Ò", "ò", "Ö", "ö", "Ō", "ō", "U", "u", "Ú", "ú",
    "Ù", "ù", "Ü", "ü", "Ū", "ū", "Y", "y", "Ý", "ý",}

S.vowels_long = {"ā", "ē", "ī", "ō", "ū",}

S.vowels_short = {"a", "e", "i", "o", "u",}

S.diphthongs = { "ie", "io", "iu", "ia", "ei", "eu", "ea", "oi", "oe", "ou", "oa", "ui", "ue", "ua", "ai", "ae", "au", "IE", "IO", "IU", "IA", "EI", "EU", "EA", "OI", "OE", "OU", "OA", "UI", "UE", "UA", "AI", "AE", "AU", "Ie", "Io", "Iu", "Ia", "Ei", "Eu", "Ea", "OI", "Oe", "Ou", "Oa", "Ui", "Ue", "Ua", "Ai", "Ae", "Au",}






S.common_before =
{
    { '0' },
    { '1' },
    { '2' },
    { '3' },
    { '4' },
    { '5' },
    { '6' },
    { '7' },
    { '8' },
    { '9' },
}

S.common_after =
{
    { ' ' },
    { '¹' },
    { '²' },
    { '³' },
    { '⁴' },
    { '⁵' },
    { '⁶' },
    { '⁷' },
    { '⁸' },
    { '⁹' },
}


S.lkx_alphabet =
{
    { ' ' },
    { 'a', 'á', 'à', 'ä' },
    { 'ā' },
    { 'b' },
    { 'c' },
    { 'd' },
    { 'e', 'é', 'è', 'ë' },
    { 'ē' },
    { 'f' },
    { 'g' },
    { 'h' },
    { 'i', 'í', 'ì', 'ï' },
    { 'ī' },
    { 'j' },
    { 'k' },
    { 'l' },
    { 'm' },
    { 'n' },
    { 'ŋ' },
    { 'ñ' },
    { 'o', 'ó', 'ò', 'ö' },
    { 'ō' },
    { 'p' },
    { 'q' },
    { 'r' },
    { 's' },
    { 't' },
    { 'u', 'ú', 'ù', 'ü' },
    { 'ū' },
    { 'v' },
    { 'w' },
    { 'x' },
    { 'y' },
    { 'z' },
    { 'þ' },
    { '0' },
}


-- for ipa.lua
--[[
S.short_to_long = {
    ['a'] = 'ā',
    ['e'] = 'ē',
    ['i'] = 'ī',
    ['o'] = 'ō',
    ['u'] = 'ū'
}

S.long_to_short = {
    ['ā'] = 'a',
    ['ē'] = 'e',
    ['ī'] = 'i',
    ['ō'] = 'o',
    ['ū'] = 'u'
}
]]
S.consonants_palat_lookup = {

    r = true,
    s = true,
    l = true,
    n = true

}

S.consonant_ipa = {

    p = "p",
    b = "b",

    f = "ɸ",
    v = "β",

    m = "m",

    t = "t",
    d = "d",

    ["þ"] = "θ",
    n = "n",

    k = "k",
    g = "g",

    x = "x",
    q = "ɣ",

    ["ŋ"] = "ŋ",

    l = "ɫ̪",
    r = "ɾ",

    s = "s",
    h = "h",
}

S.consonant_ipa_palatal = {

    l = "ʎ",
    r = "ɹ̠",
    s = "ɕ",
    n = "ɲ"
}

S.consonant_ipa_lenited = {

    ph = "ɸ",
    bh = "β",

    th = "θ",
    dh = "ð",

    kh = "x",
    gh = "ɣ",

    lh = "l̥",
    rh = "r̥",

    sh = "h"
}

S.diphthong_ipa = {

    ie = "ɪ̯ɛ",
    io = "ɪ̯ɔ",
    iu = "ɪ̯ʊ",
    ia = "ɪ̯ʌ",

    ei = "ɛɪ̯",
    oi = "ɔɪ̯",
    ui = "ʊɪ̯",
    ai = "aɪ̯",

    oe = "ɔɪ̯",
    ue = "ʊɪ̯",
    ae = "aɪ̯",

    eu = "yː",

    ou = "ɔʊ̯",
    au = "aʊ̯",

    ea = "ɛʌ̯",

    oa = "ɒː",

    ua = "ʊɑ̯"
}

S.vowel_ipa_stressed = {

    i = "ɪ",
    e = "ɛ",
    o = "ɔ",
    u = "ʊ",
    a = "ʌ",

    ["ī"] = "iː",
    ["ē"] = "eː",
    ["ō"] = "oː",
    ["ū"] = "uː",
    ["ā"] = "aː"
}

S.vowel_ipa_unstressed = {

    i = "ɪ",
    e = "ɛ",
    o = "ɔ",
    u = "ʊ",
    a = "ʌ",

    ["ī"] = "i",
    ["ē"] = "e",
    ["ō"] = "o",
    ["ū"] = "u",
    ["ā"] = "a"
}

S.diphthong_palat = {

    ai = true,
    oi = true,
    ui = true,
    ei = true

}

S.consonant_ipa_palatal = {

    l = "ʎ",
    r = "ɹ̠",
    s = "ɕ",
    n = "ɲ"

}

S.diphthong_ipa_reduced = {

    ai = "a",
    oi = "ɔ",
    ui = "ʊ",
    ei = "ɛ"

}

S.consonants_lenit_lookup = {
    p = true,
    b = true,
    t = true,
    d = true,
    k = true,
    g = true,
    l = true,
    r = true,
    s = true,
}


return S
